import datetime as dt
import threading
import time
import os
import schedule

from telebot.types import InlineKeyboardButton, InlineKeyboardMarkup

import Chat
import Links
import database as db

import telebot
from telebot import types
import User
import Programme
import time as timing

token = "1406324519:AAGIK0HBMNtZ3IfSZ_iiy0PfM6bv8Ngch7c" #older token
#token = "1413164033:AAH0U93n1FtD9H1y6cdMOGNojfzigzsxu2M"

bot = telebot.TeleBot(token)

def commit():
    os.system('git add *')
    os.system('git commit -am "update"')
    print('git updated')

#commit()
bot.send_document(db.get_user_by_login('almosh822').chat_id, 'test.db')
schedule.every().minute.do(commit)


def message_to_id_(id_, message, attachment=None):
    bot.send_message(id_, message)
    if attachment is not None:
        bot.send_document(id_, attachment)


db.init()

time_diff = lambda first, second: (first - second + 24) % 24


def welcome(user):
    def msg(message, markup=None):
        bot.send_message(user.chat_id, message, reply_markup=markup)

    def doc(path):
        document = open(path, 'rb')
        if document is not None:
            bot.send_document(user.chat_id, document)

    msg('Добро пожаловать на тренинг! 👋🏼\nОн разработан с целью обратить ваше внимание на собственное сознание, '
        'на его содержание, на его работу и природу. Знакомство с внутренним миром не заканчивается никогда и всегда '
        'актуально.\n\nНаша задача – обратить внимание на самих себя, заметить свои чувства и эмоции, увидеть себя со '
        'стороны, выстроить крепкую и добрую связь со своим внутренним миром.\n\nУроки жизни – это уроки управления '
        'собой, и данный тренинг ставит перед собой цель – сформировать в нас эффективный подход к саморегуляции и '
        'самопознанию.')
    time.sleep(30)
    doc('о курсе.pdf')
    time.sleep(30)
    msg(
        'Вам будут приходить сообщения-напоминания о необходимости выполнения определенных практик. 💬\n\nКаждый день у '
        'нас будет четыре обязательных упражнения:\n✔️Медитация осознанности, которую я рекомендую выполнять '
        'утром\n✔️Моменты возвращения внимания к настоящему\n✔️Медитация любящей доброты (её буддийское название – '
        'метта)\n✔️Запись своих мыслей и эмоций уже под вечер\n\nДень лучше начинать с фокусировки и расслабления – '
        'настраиваясь на волну осознанности, а заканчивать с добротой к себе и анализом произошедшего, как делали в '
        'школе Пифагора.\nПомимо основных трех практик будут дополнительные в течение дня (они не занимают много '
        'времени) и упражнения на самопознание ближе к вечеру.\n')
    msg('Предлагаю вам определиться с выбором времени, когда будет комфортно выполнять упражнения\n'
        'Укажите текущее время в вашем регионе. Например, если сейчас 16:30, напишите 16 в чат.')


def after_settings(user):
    def msg(message, markup=None):
        bot.send_message(user.chat_id, message, reply_markup=markup)

    def doc(path):
        document = open(path, 'rb')
        if document is not None:
            bot.send_document(user.chat_id, document)

    msg('Наше первое задание – определиться с тем, насколько мы внимательны в повседневной жизни. ✅\nДавайте ответим '
        'на простые вопросы и заодно проанализируем свои привычки. Можете записать свои ответы, чтобы потом сравнить '
        'их с ответами на те же вопросы по окончании курса.\nВозможно, мысль о повторном ответе смотивирует сразу '
        'определить для себя области, которые нуждаются в изменениях и аспекты, в которых мы эти изменения ждём и '
        'желаем получить.\n')
    doc('упр проверка внимания.pdf')
    time.sleep(3600)
    msg('Сегодня мы будем только знакомиться с тренингом и основными понятиями. Сама программа начнётся завтра.')
    msg('🗓Программа тренинга на первую неделю: \n1 день \nМедитация Осознанное дыхание (5 минут на '
        'выполнение)\nУпражнение Десять камней (10 секунд на выполнение)\nМедитация Метта на себя (от 5 до 15 минут '
        'на выполнение)\nУпражнение Самоотчёт (от 3 минут на выполнение)\n\n2 день \nМедитация Осознанное '
        'дыхание\nУпражнение Десять камней\nУпражнение Я свой лучший друг!\nМедитация Метта на себя\nУпражнение '
        'Самоотчёт\n\n3 день \nМедитация Осознанное дыхание\nУпражнение Десять камней\nМедитация Метта на '
        'себя\nУпражнение Самоотчёт\n для самооценки \nУпражнение Самоотчёт\n\n4 день \nМедитация Осознанное дыхание / '
        'Медитация Счёт\nУпражнение Десять камней\nМедитация Метта на себя\nУпражнение Самоотчёт\n\n5 день \nМедитация '
        'Осознанное дыхание\nУпражнение Десять камней\nМедитация Метта на себя\nУпражнение Самоотчёт\n\n6 день '
        '\nМедитация Осознанное дыхание\nУпражнение Десять камней\nМедитация Метта на себя\nУпражнение Вопросы '
        'самооценки\nУпражнение Самоотчёт\n\n7 день \nМедитация Осознанное дыхание\nУпражнение Десять камней\nМедитация '
        'Метта на себя\nУпражнение Самоотчёт')
    msg('В этом тренинге мы будем пользоваться некоторыми понятиями, которые являются якорями и ориентирами в нашей '
        'работе с собственным сознанием и внутренним миром. Рассмотрим их.\n❗️ Основные понятия')
    doc('основные понятия.pdf')
    time.sleep(1800)
    msg('Давайте попробуем сделать наше первое упражнение на привнесение внимания в обычное повседневное дело, '
        'стандартная и классическая практика осознанности. ☕️')
    doc('упр кофейная мед.pdf')
    time.sleep(1800)
    msg('А теперь ещё немного теории. Предлагаю вашему вниманию две небольшие статьи:\n❗️Что такое медитация?\n'
        '❗️Позы для медитации\n')
    doc('что такое медитация.pdf')
    doc('позы для медитации.pdf')
    time.sleep(1800)
    msg('И последнее на сегодня очень важное понятие, которым мы будем пользоваться\n❗️Ум новичка')
    doc('ум новичка.pdf')


@bot.callback_query_handler(lambda query: query.data == 'done')
def process_callback_1(query):
    # bot.edit_message_reply_markup(chat_id=query.message.chat.id, message_id=query.message.message_id)  # removes markup
    user = db.get_user_by_login(query.message.chat.username)
    day = (dt.datetime.utcnow() - user.start).days
    if user.done[day] == '0':
        user.stage = 6
        db.update_user(user)
        bot.send_message(query.message.chat.id, 'Отправьте свой отчет в чат.')
    else:
        bot.send_message(query.message.chat.id, 'Самоотчет выполняется только раз в день.')


@bot.callback_query_handler(lambda query: query.data[:4] == 'link')
def process_callback_1(query):
    # bot.edit_message_reply_markup(chat_id=query.message.chat.id, message_id=query.message.message_id) #removes markup
    link = db.get_link_by_name(query.data[4:])
    bot.send_message(query.message.chat.id, link.text)
    files = link.attachment.split()
    for file in files:
        try:
            bot.send_photo(query.message.chat.id, file)
        except Exception as e:
            bot.send_document(query.message.chat.id, file)


@bot.message_handler(commands=['help', 'start'])
def start_message(message):
    text = message.text
    id_ = message.chat.id
    name = message.chat.first_name
    login = message.chat.username

    def msg(message, markup=None):
        bot.send_message(id_, message, reply_markup=markup)

    # inline_btn_1 = InlineKeyboardButton('Первая кнопка!', callback_data='sdss')
    # inline_kb1 = InlineKeyboardMarkup(True).add(inline_btn_1)
    # msg("Первая инлайн кнопка", inline_kb1)

    #def remove_markup():
    #    t = bot.send_message(id_, 'text', reply_markup=types.ReplyKeyboardHide())
    #    bot.delete_message(id_, t.message_id)

    def doc(document):
        if document is not None and document != '':
            try:
                bot.send_photo(id_, document)
            except Exception as e:
                bot.send_document(id_, document)

    #remove_markup()
    markup = types.ReplyKeyboardMarkup(True, True)
    markup.row('Настройки', 'Обратная связь', 'FAQ')
    resp = 'Вы успешно вошли в главное меню.\nНажмите Настройки для просмотра/изменения часового пояса и времени ' \
           'ежедневных напоминаний.\nНажмите Обратная связь для общения с администрацией.\nНажмите FAQ для просмотра ' \
           'ответов на часто задаваемые вопросы.\n '

    # if not db.is_allowed_login(login):

    #    return
    # TODO payment

    if db.get_user_by_login(login) is None:
        new_user = User.User(chat_id=id_, login=login, start=dt.datetime.utcnow())
        db.add_user(new_user)
        threading.Thread(target=welcome(new_user)).start()
        return

    user = db.get_user_by_login(login)

    if db.is_admin(user):
        resp = 'Вы успешно вошли как администратор.'
        markup_admin = types.ReplyKeyboardMarkup(True, True)
        markup_admin.row('Просмотреть уведомления', 'Добавить уведомление')
        markup_admin.row('Сообщения от пользователей')
        markup_admin.row('Просмотреть все ссылки', 'Добавить ссылку')
        msg(resp, markup_admin)
        user.stage = 0
        db.update_user(user)
        return

    msg(resp, markup)
    user.stage = 2
    db.update_user(user)


@bot.message_handler(content_types=['text', 'document', 'photo', 'audio'])
def send_text(message):
    print(str(message))
    text = message.text
    if text is None:
        text = message.caption
    id_ = message.chat.id
    name = message.chat.first_name
    login = message.chat.username
    print('receiving {0} from {1} at {2}'.format(text, name, dt.datetime.now()))
    document = ''
    nums = [int(s) for s in text.split() if s.isdigit()] if text is not None else None
    if message.document is not None:
        document += message.document.file_id
    if message.photo is not None:
        document += message.photo[1].file_id
    if message.audio is not None:
        document += message.audio.file_id
    print('document is {0}'.format(document))

    #def remove_markup():
    #    t = bot.send_message(id_, 'text', reply_markup=types.ReplyKeyboardRemove())
    #    bot.delete_message(id_, t.message_id)

    def msg(message, markup=None):
        bot.send_message(id_, message, reply_markup=markup)

    def doc(document):
        if document is not None:
            if type(document) is str:
                document = document.split()
                if (len(document) > 1):
                    for d in document:
                        try:
                            bot.send_photo(id_, d)
                        except Exception as e:
                            bot.send_document(id_, d)
                else:
                    try:
                        bot.send_photo(id_, document[0])
                    except Exception as e:
                        try:
                            bot.send_document(id_, document[0])
                        except Exception as e:
                            print(e)
            else:
                try:
                    bot.send_photo(id_, document)
                except Exception as e:
                    bot.send_document(id_, document)

    if text is None:
        print(str(message))
        msg('Кажется, вы ничего не ввели в чат.')
        return

    # TODO payments
    # if not db.is_allowed_login(login):
    #    msg("У Вас нет доступа к этому чату.")
    #    return

    # register new user
    if db.get_user_by_login(login) is None:
        new_user = User.User(chat_id=id_, login=login, start=dt.datetime.utcnow())
        db.add_user(new_user)
        threading.Thread(target=welcome(new_user)).start()
        return

    user = db.get_user_by_login(login)

    if db.is_admin(user):
        # add not
        if user.stage == 1:
            if text == 'Настраиваемое напоминание':
                msg('Введите день, в который придет напоминание, его порядковый номер, '
                    'в следующей строке текст и приложите документ, если необходимо.')
                user.stage = 2
                db.update_user(user)
                return
            elif text == 'Промежуточное напоминание':
                msg('Введите день и время напоминания в формате дд чч мм,в следующей строке его текст и приложите '
                    'документ, если необходимо.')
                user.stage = 3
                db.update_user(user)
                return
            elif text == 'Другое сообщение':
                msg('Введите день месяца и время сообщения в формате дд чч мм, в следующей строке его текст и '
                    'приложите документ, если необходимо')
                user.stage = 4
                db.update_user(user)
                return
            else:
                markup = types.ReplyKeyboardMarkup(True, True)
                markup.row('Настраиваемое напоминание', 'Промежуточное напоминание', 'Другое сообщение')
                msg('Неверный формат ввода. Попробуйте еще раз или введите /start для выхода в главное меню.', markup)
                return

        if user.stage == 2:
            try:
                day = nums[0]
                number = nums[1] - 1
                text = text[1:]
                event = Programme.Event(text, document, 0, number, dt.datetime.utcnow().replace(year=day))
                db.add_event(event)
                msg('Уведомление успешно добавлено\nВведите /start для выхода в главное меню.')
                user.stage = 0
                return
            except Exception as e:
                print(e)
                msg('Неверный формат ввода. Введите день, в который придет напоминание, его порядковый номер, '
                    'в следующей строке текст и приложите документ, если необходимо. Для выхода в главное меню '
                    'введите /start')
                return

        if user.stage == 3:
            try:
                datetime = dt.datetime.utcnow(). \
                    replace(year=nums[0], hour=nums[1], minute=nums[2])
                text = text[8:]
                event = Programme.Event(text, document, 1, -1, datetime)
                db.add_event(event)
                msg('Уведомление успешно добавлено. Введите /start для выхода в главное меню.')
                user.stage = 0
                return
            except Exception as e:
                print(e)
                msg('Неверный формат ввода. Введите день и время напоминания в формате дд чч мм,в следующей строке '
                    'его текст и приложите документ, если необходимо. Для выхода в главное меню введите /start')
                return

        if user.stage == 4:
            try:
                datetime = dt.datetime.utcnow().replace(day=nums[0], hour=nums[1], minute=nums[2])
                text = text[9:]
                event = Programme.Event(text, document, 2, -1, datetime)
                db.add_event(event)
                msg('Уведомление успешно добавлено. Вы можете добавить еще уведомления, либо введите /start для '
                    'выхода в главное меню.')
                return
            except Exception as e:
                print(e)
                msg(
                    'Неверный формат ввода. Введите день месяца и время сообщения в формате дд чч мм, в следующей '
                    'строке его текст и приложите документ, если необходимо.\nДля выхода в главное меню введите /start')
                return

        if user.stage == 5:
            if '№' in text:
                try:
                    num = nums[0]
                    if '@#' in text:
                        db.delete_event(num)
                        msg('Сообщение №{0} успешно удалено. Вы можете продолжить просматривать/изменять сообщения.\n'
                            'Либо введите /start для выхода в главное меню.'.format(num))
                        return
                    else:
                        txt = text[text.find('Текст: ') + 7:]
                        event = db.get_event_by_id(num)
                        event.text = txt
                        if event.attachment is None:
                            event.attachment = ''
                        event.attachment += ' ' + document
                        if event.type == 0:
                            event.datetime.replace(year=nums[1])
                            event.number = nums[2]
                        elif event.type == 1:
                            event.datetime.replace(year=nums[1])
                            event.datetime.replace(hour=nums[2])
                            event.datetime.replace(minute=nums[3])
                        else:
                            event.datetime.replace(day=nums[1])
                            event.datetime.replace(hour=nums[2])
                            event.datetime.replace(minute=nums[3])
                        db.update_event(event)
                        msg('Сообщение №{0} успешно изменено. Вы можете продолжить просматривать/изменять сообщения.\n'
                            'Либо введите /start для выхода в главное меню.'.format(num))
                        return
                except Exception as e:
                    print(e)
                    msg('Неверный формат ввода. Чтобы изменить сообщение, скопируйте его в поле ввода и '
                        'отправьте отредактированный вариант. Вы можете приложить документ, чтобы добавить его к '
                        'сообщению.\n Для удаления оповещения введите "№ X @#", где X - его номер\n'
                        'Введите другой день, если хотите просмотреть напоминания для него.\n'
                        'Для выхода в главное меню нажмите /start')
                    return

            elif text == 'Покажи недавние другие сообщения':
                events = db.all_events()
                for event in events:
                    if event.type == 2:
                        msg('№ {0}\nДень месяца и время: {1}\nТекст: {2}'.
                            format(event.id_, event.datetime.strftime('%d %H %M'), event.text))
                        doc(event.attachment)
                msg('Показаны недавние другие сообщения. Чтобы изменить сообщение, скопируйте его в поле ввода и '
                    'отправьте отредактированный вариант. Вы можете приложить документ, чтобы добавить его к '
                    'сообщению.\n Для удаления оповещения введите "№ X @#", где X - его номер\n'
                    'Введите другой день, если хотите просмотреть напоминания для него.\n'
                    'Нажмите /start для выхода в главное меню.')
                return
            try:
                day = int(text)
            except Exception as e:
                markup = types.ReplyKeyboardMarkup(True, True)
                markup.row('Покажи недавние другие сообщения')
                msg('Неверный формат ввода. Введите день, для которого хотите просмотреть напоминания. Для выхода в '
                    'меню введите /start', markup)
                return

            events = db.all_events()
            for event in events:
                if day == event.day:
                    if event.type == 1:
                        msg('№ {0}\nНомер дня и время {1} {2}\nТекст: {3}'.
                            format(event.id_, str(int(event.datetime.strftime('%Y'))), event.datetime.strftime('%H %M'),
                                   event.text))
                        doc(event.attachment)
                    if event.type == 0:
                        msg('№ {0}\nНомер дня и порядковый номер {1} {2}\nТекст: {3}'.
                            format(event.id_, str(int(event.datetime.strftime('%Y'))), event.number, event.text))
                        doc(event.attachment)

            msg('Чтобы изменить напоминание, скопируйте его в поле ввода и отправьте отредактированный вариант. Вы '
                'можете приложить документ, чтобы добавить его к сообщению.\n Для удаления оповещения введите № X @#.\n'
                'Введите другой день, если хотите просмотреть напоминания для него.\n'
                'Нажмите /start для выхода в главное меню.')
            return

        if user.stage == 6:
            txt = text.split(sep='\n')
            user = db.get_user_by_login(txt[0])
            for i in range(2, len(txt)):
                txt[1] += '\n' + txt[i]
            try:
                bot.send_message(user.chat_id, txt[1])
                if document is not None and document != '':
                    bot.send_document(user.chat_id, document)
                msg('Сообщение отправлено. Продолжайте отвечать пользователям, либо введите /start, чтобы '
                    'вернуться в главное меню.')
            except Exception as e:
                print(e)
                msg('Неверный формат ввода. Введите логин пользователя и сообщение в следующей строке, либо введите '
                    '/start, чтобы вернуться в главное меню.')
            return

        # add link
        if user.stage == 7 and text is not None:
            txt = text.split(sep='\n')
            if len(txt) < 2 or len(txt[0]) == 0 or len(txt[1]) == 0:
                msg('Неверный формат ввода. Введите название упражнения, для которого хотите добавить ссылку, '
                    'в следующей строке его описание и приложите документ, если необходимо, либо введите /start, чтобы '
                    'вернуться в главное меню.')
                return
            for i in range(2, len(txt)):
                txt[1] += '\n' + txt[i]
            db.add_link(Links.Link(txt[0], txt[1], document))
            msg('Ссылка для упражнения {0} успешно добавлена. Вы можете добавить еще ссылки, либо введите /start для '
                'выхода в главное меню.'.format(txt[0]))
            return

        # edit links
        if user.stage == 8:
            if '@#' in text:
                txt = text[:-3]
                db.delete_link(txt)
                msg('Ссылка для упражнения {0} успешно удалена. Вы можете продолжить изменять/удалять ссылки.\n'
                    'Либо введите /start для выхода в главное меню.'.format(txt))
                return
            txt = text.split(sep='\n')
            if len(txt) < 2 or len(txt[0]) == 0 or len(txt[1]) == 0:
                msg('Неверный формат ввода. Чтобы изменить ссылку, скопируйте ее в поле ввода и отправьте '
                    'отредактированный вариант. Вы можете приложить документ, чтобы добавить его к ссылке\n '
                    'Для удаления ссылки введите название упражнения и @#. Например, Самоотчет @#\n'
                    'Нажмите /start для выхода в главное меню.')
                return
            for i in range(2, len(txt)):
                txt[1] += '\n' + txt[i]
            link = db.get_link_by_name(txt[0])
            link.text = txt[1]
            link.attachment += ' ' + document
            db.update_link(link)
            msg('Ссылка для упражнения {0} успешно изменена. Вы можете продолжить изменять/удалять ссылки.\n'
                'Либо введите /start для выхода в главное меню.'.format(link.name))

        if text == 'Сообщения от пользователей':
            messages = db.all_messages()
            db.delete_messages()
            msg('Пользователи отправили {0} новых сообщений'.format(len(messages)))
            for m in messages:
                msg('{0} в {1} написал:\n{2}'.format(m.login, m.datetime, m.text))
            msg('Чтобы ответить, введите логин пользователя и сообщение в следующей строке, либо введите /start, чтобы '
                'вернуться в главное меню.')
            user.stage = 6
            db.update_user(user)

        if text == 'Добавить уведомление':
            markup = types.ReplyKeyboardMarkup(True, True)
            markup.row('Настраиваемое напоминание', 'Промежуточное напоминание', 'Другое сообщение')
            msg('Какое уведомление Вы хотите добавить?', markup)
            user.stage = 1
            db.update_user(user)
            return

        if text == 'Просмотреть уведомления':
            markup = types.ReplyKeyboardMarkup(True)
            markup.row('Покажи недавние другие сообщения')
            msg('Введите день, для которого хотите просмотреть напоминания', markup)
            user.stage = 5
            db.update_user(user)
            return

        if text == 'Добавить ссылку':
            msg('Введите название упражнения, для которого хотите добавить ссылку, в следующей строке его описание и '
                'приложите документ, если необходимо.')
            user.stage = 7
            db.update_user(user)
            return

        if text == 'Просмотреть все ссылки':
            links = db.all_links()
            for link in links:
                msg('{0}\n{1}'.format(link.name, link.text))
                doc(link.attachment)
            msg('Показаны все ссылки.\nЧтобы изменить ссылку, скопируйте ее в поле ввода и отправьте отредактированный '
                'вариант. Вы можете приложить документ, чтобы добавить его к ссылке\n'
                'Для удаления ссылки введите название упражнения и @#. Например, Самоотчет @#\n'
                'Нажмите /start для выхода в главное меню.')
            user.stage = 8
            db.update_user(user)
            return

        return

    # 1 этап - часовой пояс
    if user.stage in [0, 3]:
        try:
            hours = int(text)
            if 0 <= hours < 24:
                user.time_diff = int(time_diff(hours, timing.gmtime().tm_hour))
                user.next_stage()
                db.update_user(user)
                msg('Ваш часовой пояс GMT+{0} успешно установлен. Вы можете изменить его в настройках.'.format(
                    str(user.time_diff)))
                if user.stage == 3:
                    user.stage = 2
                    db.update_user(user)
                    return
                msg('Теперь укажите, в какое время вы хотите получать ежедневные напоминания о выполнении упражнений.\n'
                    'Введите время в формате чч мм 3(или сколько надо) раза.')
                return
            raise ValueError
        except Exception as e:
            print(str(e))
            msg("Неверный формат. Введите число от 0 до 23. Например, если сейчас 12:10, напишите 12 в чат.\n"
                "Если хотите отменить регистрацию, введите /start")
    # 2 этап - установка времени напоминаний
    elif user.stage in [1, 4]:
        times = []
        strings = text.replace(':', ' ').replace('.', ' ').replace(',', ' ').split()
        if len(strings) % 2 > 0:
            msg('Неверный формат. Введите время в формате чч мм 3(или сколько надо) раза.\n'
                'Если хотите отменить регистрацию, введите /start')
            return

        for i, value in enumerate(strings):
            try:
                value = int(value)
            except Exception as e:
                print(e)
                msg('Неверный формат. Введите время в формате чч мм 3 раза.\n'
                    'Если хотите отменить регистрацию, введите /start')
                return
            if not ((i % 2 == 0 and 0 <= value < 25) or (i % 2 == 1 and 0 <= value < 61)):
                msg('Неверный формат. Введите время в формате чч мм 3 раза.\n'
                    'Если хотите отменить регистрацию, введите /start')
                return
            if i % 2 > 0:
                times[i // 2].append(value)
            else:
                times.append([])
                times[i // 2].append(value)

        user.times = times
        db.update_user_timing(user)
        resp = ''
        for p in times:
            t = dt.time(p[0], p[1])
            resp += t.strftime('%H:%M') + '\n'
        msg('Настройки времени успешно установлены. Вы будете получать ежедневные уведомления о практике в\n' + resp)
        if user.stage == 4:
            user.stage = 2
            db.update_user(user)
            return

        user.next_stage()
        db.update_user(user)
        threading.Thread(target=after_settings(user)).start()
        return
    # сообщение
    elif user.stage == 5:
        db.add_message(Chat.Message(login, text, document))
        msg('Сообщение отправлено. Ожидайте ответа. Вы можете написать еще одно, либо выйти в главное меню, '
            'нажав /start')

    elif user.stage == 6:
        day = (dt.datetime.utcnow() - user.start).days
        t = list(user.done)
        t[day] = '1'
        user.done = ''.join(t)
        user.stage = 2
        msg('Отчет принят! Продолжайте в том же духе!')
        f = open('puzzles/{0} {1}.jpg'.format((day - 1) // 7 + 1, day % 7 if day % 7 != 0 else 7), 'rb')
        doc(f)
        db.update_user(user)
        if day % 7 == 0:
            for i in range(day - 7 + 1, day + 1):
                if user.done[i] == '0':
                    break
                if i == day:
                    msg('Поздравляю! Вы выполняли Самоотчет в течение недели и собрали картину.')
                    f = open('puzzles/{0}.jpg'.format(day // 7), 'rb')
                    doc(f)

    if text == 'Настройки':
        markup = types.ReplyKeyboardMarkup(True, True)
        markup.row('Изменить часовой пояс', 'Изменить время ежедневных напоминаний')
        times = db.get_user_timing(user)
        resp = ''
        for p in times:
            t = dt.time(p[2], p[3])
            resp += t.strftime('%H:%M') + '\n'
        msg('Ваши текущие настройки:\n'
            'Часовой пояс GMT+{0}\n'
            'Ежедневные напоминания приходят в\n{1}'
            'Хотите что-то изменить? Для выхода в главное меню введите /start'.format(user.time_diff, resp), markup)

    if text == 'Изменить часовой пояс':
        user.stage = 3
        msg('Укажите текущее время в Вашем регионе\nНапример, если сейчас 16:30, напишите 16 в чат.')
        db.update_user(user)

    if text == 'Изменить время ежедневных напоминаний':
        user.stage = 4
        msg('Укажите, в какое время вы хотите получать ежедневные напоминания о выполнении упражнений.\n'
            'Введите время в формате чч мм 3(или сколько надо) раза.')
        db.update_user(user)

    if text == 'Обратная связь':
        user.stage = 5
        msg('Введите свое сообщение. Администрация прочитает его и ответит как можно быстрее.')
        db.update_user(user)

    if text == 'FAQ':
        msg('Тут будет FAQ\nНажмите /start для выхода в главное меню.')


bot.polling()
